backend/controllers/AccountController.php

SELECT COUNT(*) FROM `tb_user_account` WHERE 1=1 ORDER BY `id` DESC
SELECT * FROM `tb_user_account` WHERE 1=1 ORDER BY `id` DESC LIMIT 15
SELECT * FROM `tb_user` WHERE `id` IN (35, 34, 33, 32, 31, 30, 29, 28, 27, 26, 24, 23, 22, 21, 20)
---
    public function actionList() {
        $search = [];
        $condition = '1=1';
        if ($this->request->get('search_submit')) { // 过滤
            $search = $this->request->get();
            if (!empty($search['username'])) {
                $username = $search['username'];
                $result = Yii::$app->db->createCommand('select * from tb_user WHERE username ="' . $username . '"')->queryOne();
                $uid = $result["id"];
                $condition .= " AND user_id = " . intval($uid);
            }
            if (!empty($search['realname'])) {
                $realname = $search['realname'];
                $result = Yii::$app->db->createCommand('select * from tb_user WHERE realname ="' . $realname. '"')->queryOne();
                $uid = $result["id"];
                $condition .= " AND user_id = " . intval($uid);
            }
            if (!empty($search['user_id'])) {
                    $condition .= " AND user_id = " . intval($search['user_id']);
            }
        }
        $query = UserAccount::find()->where($condition)->orderBy('id desc');
        $countQuery = clone $query;
        $pages = new Pagination(['totalCount' => $countQuery->count()]);
        $pages->pageSize = 15;
        $accounts = $query->with('user')->offset($pages->offset)->limit($pages->limit)->all();