backend/controllers/DeviceController.php

SELECT COUNT(*) FROM `tb_device_info` ORDER BY `id` DESC
SELECT * FROM `tb_device_info` ORDER BY `id` DESC LIMIT 15
---
	public function actionList()
	{
		$query = DeviceInfo::find()->orderBy('id desc');
		$countQuery = clone $query;
		$pages = new Pagination(['totalCount' => $countQuery->count()]);
		$pages->pageSize = 15;
		$devices = $query->offset($pages->offset)->limit($pages->limit)->all();