backend/controllers/DocumentController.php

			];
		}
		if ($currentAction) {
			$api = DocumentApi::findOne(['name' => $action]);
---
SELECT * FROM `tb_document_api` WHERE `name`='frontend\\controllers\\ProjectController::actionDetail'