backend/controllers/UserController.php

    public function actionList()
    {
        $condition = $this->getFilterCondition(); // 过滤
        $query = User::find()->where($condition)->orderBy('id desc');
        $countQuery = clone $query;
        $pages = new Pagination(['totalCount' => $countQuery->count()]);
        $pages->pageSize = 15;
        $users = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `tb_user` WHERE 1=1 ORDER BY `id` DESC
SELECT * FROM `tb_user` WHERE 1=1 ORDER BY `id` DESC LIMIT 15 OFFSET 15

    public function actionDetailList()
    {
    	$condition = $this->getFilterCondition();
    	$query = UserDetail::find()->where($condition)->orderBy('id desc');
    	$countQuery = clone $query;
    	$pages = new Pagination(['totalCount' => $countQuery->count()]);
    	$pages->pageSize = 15;
    	$users = $query->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `tb_user_detail` WHERE 1=1 AND id = 0 ORDER BY `id` DESC
SELECT * FROM `tb_user_detail` WHERE 1=1 AND id = 0 ORDER BY `id` DESC LIMIT 15

    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `tb_user` WHERE `id`=31