frontend/controllers/AccountController.php

SELECT * FROM `tb_user_bank_card` WHERE (`user_id`=12) AND (`status`=1)
---
	public function actionRemain()
	{
		$curUser = Yii::$app->user->identity;
		// 是否要显示充值根据第三方支付判断
		$card = UserBankCard::findOne([
			'user_id' => $curUser->id,
			'status' => UserBankCard::STATUS_BIND
		]);

SELECT `bank_id`, `bank_name`, `card_no`, `third_platform` FROM `tb_user_bank_card` WHERE `user_id`=12
---
	public function actionGet()
	{
		$curUser = Yii::$app->user->identity;
		$cards = UserBankCard::find()->select(
			['bank_id', 'bank_name', 'card_no', 'third_platform']
		)->where(['user_id' => $curUser->id])->asArray()->all();

SELECT 1 FROM `tb_order` WHERE `order_id`='2015010512_5052054aa5709820ee'
INSERT INTO `tb_order` (`order_id`, `type`, `user_id`, `money`, `created_at`, `updated_at`) VALUES ('2015010512_5052054aa5709820ee', 3, 12, 0, 1420449545, 1420449545)
---
	public function actionWithdrawOrder()
	{
		$curUser = Yii::$app->user->identity;

		// 简单验证
		if (!$curUser->getUserPayPassword()) {
			throw new UserException('您还没有设置交易密码');
		}

		$order = new Order();
		$order->order_id = Order::generateOrderId();
		$order->type = Order::TYPE_WITHDRAW;
		$order->user_id = $curUser->id;
		$order->money = 0; // 提现不提前村金额
		if ($order->save()) {