frontend/controllers/AppController.php

	public function actionIndex()
	{
		$data = [];
		$setting = Setting::findByKey('project_index');
		if ($setting) {
			$settingValue = unserialize($setting->svalue);
			foreach ($settingValue as $v) {
				if ($v['id'] == 0) {
					$kdb = KdbInfo::findKoudai();
					$success_money = $kdb->total_money - $kdb->curAccount['cur_money'];
					$data[] = [
						'id' => 0,
						'name' => $v['title'],
						'apr' => $kdb->apr,
						'total_money' => $kdb->total_money,
						'success_money' => $success_money,
						'success_percent' => intval(100 * $success_money / $kdb->total_money),
						'min_invest_money' => $kdb->min_invest_money,
						'words' => '随取随存',
						'is_novice' => 0,
					];
				} else {
					$project = Project::findOne(intval($v['id']));
---
SELECT * FROM `tb_project` WHERE `id`=7

	public function actionDeviceReport()
	{
		// 如果是ios模拟器，则直接忽略
		if ($this->client->deviceName == 'iPhone Simulator') {
			return ['code' => 0];
		}

		$device_id = trim($this->request->post('device_id'));
		$installed_time = trim($this->request->post('installed_time'));
		$uid = intval($this->request->post('uid'));
		$username = trim($this->request->post('username'));
		$net_type = strtoupper(trim($this->request->post('net_type')));

		// 新增或更新设备信息
		$info = DeviceInfo::findOne(['device_id' => $device_id]);
---
SELECT * FROM `tb_device_info` WHERE `device_id`='853c5877bf1f0e2fcecd3639cd7aab8fd2c91c39'