frontend/controllers/CreditController.php

    public function actionRecentlyPublishedAssignableItems(
        $page = self::DEFAULT_PAGE,
        $pageSize = self::ASSIGNABLE_ITEMS_PAGE_SIZE
    )
    {

        $page = $page < 1 ? 1 : $page;
        $creditQuery = CreditBaseInfo::find();
        $totalCount = $creditQuery->where(['status' => CreditBaseInfo::STATUS_ASSIGNING ])->count();
        /*$pages = new Pagination(['totalCount' => $totalCount]);
        $pages->page = $page - 1;
        $pages->pageSize = $pageSize;


        // 1. 查询 tb_ca_base_info 基本表获得转让的债权
        $results = $creditQuery->select([
            'id',
            'project_type',
            'invest_id',
            'project_id',
            'assign_start_date',
            'assign_end_date',
            'assign_fee',
            'assign_rate',
            'user_id',
            'user_name',
            'commission_rate',
            'status',
        ])->where( ['status' => CreditBaseInfo::STATUS_ASSIGNING] )
            ->orderBy("updated_at desc")
            ->offset($pages->offset)->limit($pages->limit)->with([
            "project" => function(ActiveQuery $query){
                $query->select([
                    'id',
                    'name',
                    'type',
                    'status',
                    'period',
                    'is_day',
                    'effect_time',
                    'created_username',
                    'publish_username',
                    'total_money',
                    'success_money',
                    'apr',
                    'is_novice',
                    'desc',
                ]);
            }
        ])->asArray()->all();
---
SELECT `id`, `name`, `type`, `status`, `period`, `is_day`, `effect_time`, `created_username`, `publish_username`, `total_money`, `success_money`, `apr`, `is_novice`, `desc` FROM `tb_project` WHERE `id` IN ('13', '15', '31', '33', '27', '30', '12')

    public function actionRecentlyAppliedAssignableItems(
        $page = self::DEFAULT_PAGE,
        $pageSize = self::ASSIGNABLE_ITEMS_PAGE_SIZE
    )
    {
        $investQuery = ProjectProfits::find();

        $totalCount = $investQuery->where([
            'status' => [ProjectProfits::STATUS_SUCCESS,ProjectProfits::STATUS_REPAYED],
            'is_transfer' => 1 ]
        )->count();

        $pages = new Pagination(['totalCount' => $totalCount]);
        $pages->page = $page - 1;
        $pages->pageSize = $pageSize;

        $queryItems = $investQuery->where([
            'status' => [ProjectProfits::STATUS_SUCCESS,ProjectProfits::STATUS_REPAYED],
            'is_transfer' => 1,
        ])->orderBy("updated_at desc")
            ->offset($pages->offset)->limit($pages->limit)
            ->asArray()->all();
---
SELECT COUNT(*) FROM `tb_project_profits` WHERE (`status` IN (2, 7)) AND (`is_transfer`=1)
SELECT * FROM `tb_project_profits` WHERE (`status` IN (2, 7)) AND (`is_transfer`=1) ORDER BY `updated_at` DESC LIMIT 10