frontend/controllers/PageController.php

SELECT `id`, `title`, `abstract`, `thumbnail`, `created_at` FROM `tb_activity` WHERE `status`=1 ORDER BY `id` DESC
---
	public function actionListActivity()
	{
		$activityList = (new Query())->from(Activity::tableName())->select([
			'id', 'title','abstract','thumbnail','created_at'
		])->where([
			'status' => Activity::STATUS_ACTIVE, //已发布
		])->orderBy([
			'id' => SORT_DESC,
		])->all();

SELECT * FROM `tb_activity` WHERE `status`=1 ORDER BY `id` DESC
SELECT * FROM `tb_article_type` WHERE `name`='notice_center'
SELECT * FROM `tb_article` WHERE `type_id`=10 ORDER BY `id` DESC
---
	public function actionReddotInfo()
	{
		// 最近一条活动
		$lastActivity = Activity::find()->where(['status' => Activity::STATUS_ACTIVE])->orderBy('id desc')->one();
		$articleType = ArticleType::findOne(['name' => ArticleType::TYPE_NOTICE_CENTER]);
		// 最近一条公告
		$lastNotice = Article::find()->where(['type_id' => $articleType->id])->orderBy('id desc')->one();