frontend/controllers/ProjectController.php

SELECT `id`, `name`, `status`, `total_money`, `success_money`, `success_number`, `is_novice`, `min_invest_money`, `period`, `is_day`, `apr` FROM `tb_project` WHERE (`type`=1) AND (`status` IN (3, 5, 7, 8)) ORDER BY `status`, `is_novice` DESC, `id` DESC LIMIT 10
---
	public function actionP2pList($page = 1, $pageSize = 10)
	{
		$page = $page > 1 ? intval($page) : 1;
		$pageSize = intval($pageSize);
		$offset = ($page - 1) * $pageSize;
		$projects = (new Query())->from(Project::tableName())->select([
			'id', 'name', 'status', 'total_money', 'success_money', 'success_number', 'is_novice', 'min_invest_money', 'period', 'is_day', 'apr',
		])->where([
			'type' => Project::TYPE_P2P,
			'status' => [Project::STATUS_PUBLISHED, Project::STATUS_FULL, Project::STATUS_REPAYING, Project::STATUS_REPAYED],
		])->orderBy([
			'status' => SORT_ASC,
			'is_novice' => SORT_DESC,
			'id' => SORT_DESC,
		])->offset($offset)->limit($pageSize)->all();

SELECT `id`, `name`, `status`, `total_money`, `success_money`, `success_number`, `is_novice`, `min_invest_money`, `period`, `is_day`, `apr` FROM `tb_project` WHERE (`type`=2) AND (`status` IN (3, 5, 7, 8)) ORDER BY `status`, `is_novice` DESC, `id` DESC LIMIT 10
---
	public function actionTrustList($page = 1, $pageSize = 10)
	{
		$page = $page > 1 ? intval($page) : 1;
		$pageSize = intval($pageSize);
		$offset = ($page - 1) * $pageSize;
		$projects = (new Query())->from(Project::tableName())->select([
			'id', 'name', 'status', 'total_money', 'success_money', 'success_number', 'is_novice', 'min_invest_money', 'period', 'is_day', 'apr',
		])->where([
			'type' => Project::TYPE_TRUST,
			'status' => [Project::STATUS_PUBLISHED, Project::STATUS_FULL, Project::STATUS_REPAYING, Project::STATUS_REPAYED],
		])->orderBy([
			'status' => SORT_ASC,
			'is_novice' => SORT_DESC,
			'id' => SORT_DESC,
		])->offset($offset)->limit($pageSize)->all();