common/models/KdbInfo.php

SELECT * FROM `tb_kdb_info` ORDER BY `id` DESC
---
    public static function findKoudai()
    {
    	return static::find()->orderBy('id desc')->one();