common/models/NoticeSms.php

    public static function UpdateNoticeReadStatus($uid){
        if (empty($uid)){
            return false;
        }
        return self::updateAll(['is_read'=>self::READ_YES],['user_id'=>$uid,'is_read'=>self::READ_NO]);
---
UPDATE `tb_notice_sms` SET `is_read`=1 WHERE (`user_id`=12) AND (`is_read`=0)

    public static function findNewNotice($uid,$page = 1,$pageSize = 15){
        $page = $page > 1 ? intval($page) : 1;
        $pageSize = intval($pageSize);
        $offset = ($page - 1) * $pageSize;
        return self::find()->select(['id','type','remark','created_at'])
            ->where(['user_id' => $uid])
            ->orderBy(['id' => SORT_DESC,])->offset($offset)->limit($pageSize)
            ->asArray()->all();
---
SELECT `id`, `type`, `remark`, `created_at` FROM `tb_notice_sms` WHERE `user_id`=12 ORDER BY `id` DESC LIMIT 10