common/models/Setting.php

	public static function findByKey($key)
	{
		return static::findOne(['skey' => $key]);
---
SELECT * FROM `tb_setting` WHERE `skey`='project_index'