<?php
/**
 * Created by PhpStorm.
 * User: pc
 * Date: 2014/12/10
 * Time: 10:39
 */

namespace common\exceptions;


class InvestException extends UserExceptionExt{

    public static $ERROR_MSG = array(
        // 系统错误
        "-1" => "系统繁忙",
        "-1001" => "DB错误",
        "-1002" => "参数错误",

        // 投资转让
        "1001" => "用户未登录",
        "1002" => "投资记录与用户不匹配",
        "1003" => "投资记录找不到匹配的项目",
        "1004" => "项目状态无效，无法转让",
        "1005" => "投资已转让，无法再次转让",
        "1006" => "投标未满1天，无法转让",
        "1007" => "剩余时间不足1天，无法转让",
        "1008" => "没有该投资记录",
        "1009" => "投资记录无效，无法转让",
        "1010" => "转让记录不在\"转让中\"，无法取消转让",
        "1011" => "没有投资记录对应的收益记录",
        "1012" => "项目状态无效，无法申购",
        "1013" => "投资记录不在转让中，无法申购",
        "1014" => "剩余可投资额度不够",
        "1015" => "转让投资失败",
        "1016" => "转让记录不存在",
        "1017" => "不能申购自己转让的投资",
        "1018" => "剩余时间不够，不能转让",
        "1019" => "转让价格不能低于投资本金",
        "1020" => "转让价格过高",
        "1021" => "只能转让自己投资的项目",

        // 用户错误
        "1101" => "用户未登录",
        "1102" => "密码验证失败",
        "1103" => "支付密码验证失败",

        // 用户资金相关
        "1201" => "更新用户资金失败",
        "1202" => "账户资金信息不全",
        "1203" => "绑定银行卡手机不全",
        "1204" => "银行扣款失败",

        // 支付相关
        "1301" => "支付证书配置错误",


        // 短信发送
        "1401" => "用户太多",
        "1402" => "没有合法用户",
        "1403" => "Http请求失败",
        "1404" => "短信网关报错",

        /* 支付异常错误码 */
        "2000" => "绑卡跳转SDK",       // 连连支付 - 支付0.01绑卡
        "2001" => "支付需要验证码",    // 联动支付
        "2002" => "支付跳转SDK",      // 连连支付 - 支付金额投资
        "2003" => "预留支付",
        "2004" => "预留支付",
        "2005" => "预留支付",
        "2006" => "预留支付",
        "2007" => "预留支付",
        "2008" => "预留支付",
        "2009" => "预留支付",
    );
}