backend/models/AdminUser.php

SELECT * FROM `tb_admin_user` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);